def find_sum(sequence): # объявляет функцию find_sum с аргументом sequence, который представляет собой последовательность чисел
    sum = 0 # инициализирует переменную sum со значением 0. Это значение будет использоваться для вычисления суммы элементов последовательности, которые больше 10
    for i in range(len(sequence)//2, len(sequence)): #цикл for для итерации через элементы второй половины последовательности. len(sequence)//2 определяет начальный индекс второй половины последовательности, а len(sequence) - конечный индекс.
        if sequence[i] > 10: # проверяет, является ли текущий элемент sequence[i] больше 10
            sum += sequence[i] # если текущий элемент больше 10, добавляет его значение к переменной sum
    return sum #возвращает значение sum после завершения цикла for

numbers = [1, 2, 3, 15, 20, 25, 30, 35] #numbers = [1, 2, 3, 15, 20, 25, 30, 35] - создает список numbers
result = find_sum(numbers)
print(result)





