def only_letters(string): # принимает строку в качестве входных данных и перебирает каждый символ в строке, используя цикл for
    for char in string:
        if char.isalpha():
            yield char  # Если текущий символ является алфавитом (т. е. char.isalpha() возвращает True), он выдается с помощью ключевого слова yield

# Пример использования
string = "Hello, World! 123"
letters = only_letters(string)
for letter in letters:
    print(letter)



# Генератор можно использовать в цикле for для извлечения полученных значений одно за другим
# В примере использования генератор используется для извлечения букв из строки «Hello, World! 123», и печатается каждая буква