# Дан целочисленный список A размера N (< 15).
# Переписать в новый целочисленный список B все элементы с нечетными порядковыми номерами (1,3,...)
# и вывести размер полученного списка B и его содержимое. Условный оператор не использовать.

def myFunction():
    import random  # импортируем библиотеку рандом
    N = random.randrange(2, 16) #количество цифр в списке
    a = [random.randrange(1, 20) for i in range(N)] #цифры в списке
    b = []

    print("N:", N)
    print("Список a:\n", a)

    b = a[::2]

    print("Размер масива b:\n", len(b)) #количество символов в cписке b
    print("Список b:\n", b)

myFunction()
